InformationRegisters/СертификатыЗаявокНаРегистрациюВЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СертификатыЗаявокНаРегистрациюВЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЧД003</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СертификатыЗаявокНаРегистрациюВЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Сертификат - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
//  * Доверенность - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Доверенность
Функция СертификатыЗаявки(ИдентификаторЗаявки) Экспорт
	
	РезультатЗапроса = РезультатЗапросаСертификатовЗаявки(ИдентификаторЗаявки);
	
	//@skip-check constructor-function-return-section
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Сертификат - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
//  * Доверенность - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Доверенность
Функция ВыборкаСертификатовЗаявки(ИдентификаторЗаявки) Экспорт
	
	РезультатЗапроса = РезультатЗапросаСертификатовЗаявки(ИдентификаторЗаявки);
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  РезультатЗапроса
Функция РезультатЗапросаСертификатовЗаявки(ИдентификаторЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СертификатыЗаявокНаРегистрациюВЭДО.Сертификат,
		|	СертификатыЗаявокНаРегистрациюВЭДО.Доверенность
		|ИЗ
		|	РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО КАК СертификатыЗаявокНаРегистрациюВЭДО
		|ГДЕ
		|	СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки = &ИдентификаторЗаявки";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявки);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  Массив из Строка
Функция ОтпечаткиСертификатовЗаявки(ИдентификаторЗаявки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сертификаты.Отпечаток
		|ИЗ
		|	РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО КАК СертификатыЗаявокНаРегистрациюВЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК Сертификаты
		|		ПО СертификатыЗаявокНаРегистрациюВЭДО.Сертификат = Сертификаты.Ссылка
		|ГДЕ
		|	СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки = &ИдентификаторЗаявки";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Отпечаток");
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - Строка
Процедура Удалить(ИдентификаторЗаявки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЗаявки.Установить(ИдентификаторЗаявки);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
